{
  "Lesson 3: Prompt Engineering": "Leçon 3 : Ingénierie des invites",
  "In this chapter you will learn:": "Dans ce chapitre, vous apprendrez :",
  "What prompt engineering is and how knowing the basics can help you get better re.527040429887DE4DE1EF": "Ce qu'est l'ingénierie des invites et comment connaître les bases peut vous aider à obtenir de meilleurs résultats.",
  "Different prompt engineering techniques and how they can help provide better res.F86985BF5EA497E5C6E6": "Différentes techniques d'ingénierie des invites et comment elles peuvent fournir de meilleurs résultats pour différents scénarios.",
  "What meta prompts are and how they will help restrict the output, ensure it's ac.A6A049764EFC37A9DF9B": "Ce que sont les métainvites et comment elles aideront à restreindre la sortie, garantir son accessibilité et fournir une meilleure expérience utilisateur.",
  "Setup": "Préparation",
  "If you haven't already, set up your development environment. Here's how you can .46740AA845C2F00EDCF7": "Si ce n'est pas encore fait, configurez votre environnement de développement. Voici comment procéder : [Configurez votre environnement](/docs/setup/README.md).",
  "Related Resources": "Ressources associées",
  "This video offers an introduction to improving your \"prompting\" skills, teaching.3761FEC08F4B5B6F8774": "Cette vidéo propose une introduction pour améliorer vos compétences en matière d'\"invites\", en vous apprenant à donner des instructions plus claires et efficaces à l'IA pour obtenir de meilleurs résultats.",
  "🎥 Click on the image above to watch a short video about prompt engineering": "🎥 Cliquez sur l'image ci-dessus pour regarder une courte vidéo sur l'ingénierie des invites",
  "💼 Slides: [Prompt engineering](/videos/slides/02-prompt-engineering.pptx)": "💼 Diapositives : [Ingénierie des invites](/videos/slides/02-prompt-engineering.pptx)",
  "[!NOTE]\nSo far, you've been on a journey through time with Leonardo da Vinci, ex.5B7F9383E4EEE3FE0953": "Jusqu'à présent, vous avez voyagé dans le temps avec Léonard de Vinci, explorant les merveilles de la Renaissance. Vous avez rencontré le Scarabée temporel, un dispositif mystérieux qui vous permet de voyager à travers le temps et l'espace.",
  "See [Lesson 1](/lessons/01-intro-to-genai/README.md) if you want to catch up wit.E01CE2CC16E1405BAE29": "Consultez [Leçon 1](/lessons/01-intro-to-genai/README.md) si vous souhaitez reprendre l'histoire depuis le début.",
  "[!NOTE]\nWhile we recommend going through the story (it's fun!), [click here](#in.71FCF04C75E945CC50E9": "Bien que nous recommandions de suivre l'histoire (c'est amusant !), [cliquez ici](#interact-with-sforza) si vous préférez passer directement au contenu technique.",
  "**You:** Let's see if I can manage to get back home.": "**Vous :** Voyons si je peux rentrer chez moi.",
  "Before you manage to press the button, the workshop doors slam open with a thund.9A134C09C2858C80D8BF": "Avant que vous n'ayez le temps d'appuyer sur le bouton, les portes de l'atelier s'ouvrent en grand avec un fracas assourdissant. Un homme se tient dans l'encadrement de la porte, large d'épaules et vêtu de vêtements coûteux, il agite un morceau de papier en l'air en criant :",
  "Ludovico Sforza": "Ludovico Sforza",
  "**Sforza**: Da Vinci, dov'è il mio dipinto? Where is my painting?": "**Sforza** : Da Vinci, dov'è il mio dipinto ? Où est ma peinture ?",
  "**Leonardo:** It's Sforza. He wants me to complete a painting, 'The Last Supper..1702706B164746BB09A2": "**Léonard :** C'est Sforza. Il veut que je termine une peinture, \"La Cène\".",
  "**You:** Couldn't you just tell him that?": "**Vous :** Vous ne pourriez pas simplement lui dire ça ?",
  "**Leonardo:** I've tried, but he's not a patient man.": "**Léonard :** J'ai essayé, mais ce n'est pas un homme patient.",
  "You sprint after Leonardo, bursting out the back door into a dark alley, you fin.FA9A65923B01C33A8CCB": "Vous courez après Léonard, déboulant par la porte de derrière dans une ruelle sombre, où vous trouvez un cheval et une calèche qui vous attendent.",
  "Leonardo grabs the reins and you both leap into the carriage. With a sharp crack.F450455A9E505EDB411E": "Léonard attrape les rênes et vous sautez tous les deux dans la calèche. Avec un craquement sec du fouet, le cheval s'élance, galopant à travers les rues étroites de Florence.",
  "**Leonardo:** Try pressing that gizmo, they're getting closer!": "**Léonard :** Essayez d'appuyer sur ce gadget, ils se rapprochent !",
  "**You:** \"Okay, Time Beetle, listen carefully. I need to get back to the present.724981667A75DCB1A3E1": "**Vous :** \"OK, Scarabée temporel, écoute bien. J'ai besoin de retourner dans le présent, chez moi, d'accord ?\" Soudain, la calèche heurte une bosse et le Scarabée temporel s'envole de votre main pour atterrir sur le sol. Il commence à biper et annonce d'une voix robotique : \"Direction Rome.\"",
  "**You:** No, not Rome, home... home...": "**Vous :** Non, pas Rome, chez moi... chez moi...",
  "A swirl of colors envelops the carriage, the world around you dissolving into a .72B5EC3558164CA6C77B": "Un tourbillon de couleurs enveloppe la calèche, le monde autour de vous se dissolvant en un kaléidoscope de lumière.",
  "Escape": "Fuite",
  "The swirl of colors fades, and you find yourself in the carriage, now racing dow.A134B647C84A4C2FB6A3": "Le tourbillon de couleurs s'estompe, et vous vous retrouvez dans la calèche, qui roule maintenant sur la Via Appia à Rome, et, à votre grande stupéfaction, vous êtes en plein milieu d'une course de chars. Les chars grondent en passant, leurs roues soulevant des nuages de poussière.",
  "**You:** Leonardo, where are we?": "**Vous :** Léonard, où sommes-nous ?",
  "**Leonardo:** It looks like we're in the middle of a race! We need to get out of.9CA5A49C0E1FC00CA8BC": "**Léonard :** On dirait qu'on est au milieu d'une course ! Il faut qu'on s'en sorte !",
  "You grip the sides of the carriage as it careens through the chaos. Roman soldie.47EEFFC892DBD7ED570D": "Vous vous agrippez aux côtés de la calèche alors qu'elle roule à toute vitesse à travers le chaos. Des soldats romains à cheval se rapprochent, leur armure scintillant sous le soleil.",
  "**You**: There! Head for the port!": "**Vous** : Là-bas ! Dirigez-vous vers le port !",
  "Leonardo steers the carriage towards the exit, the wheels skidding on the cobble.4E03D62DC0FF734E3ADD": "Léonard dirige la calèche vers la sortie, les roues dérapant sur les pavés. Les soldats sont à vos trousses, leurs cris résonnant dans vos oreilles.",
  "**Leonardo:** We need to lose them! Look for a place to hide!": "**Léonard :** Nous devons les semer ! Cherchez un endroit où se cacher !",
  "You scan the narrow streets, your heart racing.": "Vous scrutez les rues étroites, le cœur battant.",
  "**You:** There! A back alley!": "**Vous :** Là-bas ! Une ruelle !",
  "Leonardo veers into the alley, the carriage jolting as it navigates the tight tu.43CAC807AFC834671FDC": "Léonard s'engage dans la ruelle, la calèche sursautant alors qu'elle négocie le virage serré. Vous sautez hors de la calèche et aidez Léonard à tirer un énorme appareil de l'arrière. C'est son invention : la *vis aérienne*.",
  "**Leonardo:** Quickly, we need to get this to the roof!": "**Léonard :** Vite, il faut qu'on monte ça sur le toit !",
  "You both strain under the weight of the device. The sound of the soldiers' pursu.46C3953FC3F22A5B864A": "Vous peinez sous le poids de l'appareil. Le bruit des soldats qui approchent se fait plus fort, leurs pas résonnant contre les murs. Vous atteignez le toit, haletants et transpirants.",
  "**Leonardo:** Help me set it up!": "**Léonard :** Aidez-moi à l'installer !",
  "You work together, your hands moving with practiced precision. You both climb on.DC5CCA5914DA165F718A": "Vous travaillez ensemble, vos mains se déplaçant avec une précision exercée. Vous montez tous les deux sur l'appareil, le cœur battant à tout rompre.",
  "**Leonardo:** Hold on tight!": "**Léonard :** Tenez-vous bien !",
  "With a final push, the aerial screw begins to spin. The blades catch the air, an.7DE263B3C832BD8C6C50": "Avec un dernier effort, la vis aérienne commence à tourner. Les pales attrapent l'air, et vous ressentez une soudaine élévation. Le sol s'éloigne sous vous alors que l'appareil décolle, survolant les toits de Rome.",
  "**You:** We did it, Leonardo! We're flying!": "**Vous :** On l'a fait, Léonard ! On vole !",
  "**Leonardo:** Yes, but we need to find a safe place to land.": "**Léonard :** Oui, mais il nous faut un endroit sûr pour atterrir.",
  "You look out over the city; the ancient buildings stretch out below you.": "Vous regardez autour de vous : les bâtiments anciens s'étendent sous vos pieds.",
  "Interact with Sforza": "Interagir avec Sforza",
  "If you want to interact with Sforza, run the [Characters](/app/README.md) app.": "Si vous voulez interagir avec Sforza, lancez l'application [Personnages](/app/README.md).",
  "[!IMPORTANT]\nThis is entirely fictional; the responses are generated by AI.\n[Res.AB5D5733CAEFE6FD7D95": "Ceci est entièrement fictif ; les réponses sont générées par l'IA. [Clause de non-responsabilité concernant l'IA responsable](/README.md#responsible-ai-disclaimer)",
  "**Steps**:": "**Étapes** :",
  "Start a [![GitHub Codespace](https://img.shields.io/badge/GitHub-Codespace-brigh.61284054E9FFC92DBECD": "Démarrez un [![GitHub Codespace](https://img.shields.io/badge/GitHub-Codespace-brightgreen)](https://codespaces.new/microsoft/generative-ai-with-javascript)",
  "Navigate to */app* in the repo root.": "Navigatez jusqu'à */app* à la racine du dépôt.",
  "Locate the console and run `npm install` followed by `npm start`.": "Localisez la console et exécutez `npm install`, suivi de `npm start`.",
  "Once it appears, select the \"Open in Browser\" button.": "Une fois apparu, sélectionnez le bouton \"Ouvrir dans le navigateur\".",
  "Chat with Sforza.": "Discutez avec Sforza.",
  "For a more detailed explanation of the app, see [Detailed app explanation](/less.C2B882AE8CDAB3376C09": "Pour une explication plus détaillée de l'application, consultez [Explications détaillées sur l'app](/lessons/01-intro-to-genai/README.md#interact-with-dinocrates).",
  "[!NOTE]\nIf you're running the project locally on your machine, please review the.F5ECA5243EF893BD3245": "Si vous exécutez le projet localement sur votre machine, veuillez consulter le guide de démarrage rapide pour configurer un [jeton d'accès personnel GitHub](/docs/setup/README.md#creating-a-personal-access-token-pat-for-github-model-access) et remplacer la clé dans le code.",
  "What is prompt engineering?": "Qu'est-ce que l'ingénierie des invites ?",
  "**Time Beetle:** We need to talk about prompt engineering.": "**Scarabée temporel :** Nous devons parler d'ingénierie des invites.",
  "**You:** We do? What's that?": "**Vous :** Vraiment ? C'est quoi ça ?",
  "**Time Beetle:** Prompt engineering despite its name is not about building bridg.E9F037320154F0444EFD": "**Scarabée temporel :** L'ingénierie des invites, malgré son nom, ne concerne pas la construction de ponts ou de routes, mais plutôt l'art de formuler les bonnes \"invites\" pour obtenir les résultats souhaités d'un modèle de langage génératif basé sur l'IA.",
  "**You:** Ok, but why is it important that I know this?": "**Vous :** D'accord, mais pourquoi est-ce important que je sache ça ?",
  "**Time Beetle:** Well, you want to land the aerial screw, right?": "**Scarabée temporel :** Eh bien, vous voulez atterrir la vis aérienne, n'est-ce pas ?",
  "**You:** Yes, preferably in one piece. :-)": "**Vous :** Oui, de préférence en un seul morceau. :-)",
  "**Time Beetle:** I thought so, now listen up! Prompt engineering is about crafti.66312D03739038FC2083": "**Scarabée temporel :** C'est bien ce que je pensais, écoutez-moi maintenant ! L'ingénierie des invites consiste à formuler les bonnes invites pour obtenir les résultats désirés d'un modèle de langage.",
  "**Time Beetle** Large language models have what's called *emergent properties*, .7FCED41E7680DB951F25": "**Scarabée temporel :** Les grands modèles de langage ont ce que l'on appelle des *propriétés émergentes*, ce qui signifie qu'il s'agit de caractéristiques non explicitement programmées dans le modèle mais qui émergent de la manière dont il est entraîné sur de vastes quantités de données textuelles. En étudiant ces propriétés émergentes, vous pouvez tirer des conclusions et découvrir des schémas qui peuvent vous aider à obtenir de meilleurs résultats du modèle.",
  "**You:** Ok, so there are patterns we discover that can help us get better resul.6A234423F808F37999BF": "**Vous :** D'accord, donc il y a des schémas que nous découvrons qui peuvent nous aider à obtenir de meilleurs résultats du modèle. Mais comment cela m'aide-t-il à atterrir la vis aérienne ?",
  "**Time Beetle:** Yes correct, and wow, you're not a patient one are you?": "**Scarabée temporel :** Oui, c'est exact, et wow, vous n'êtes pas très patient, n'est-ce pas ?",
  "**You:** Well, you wouldn't be either if you were flying in a contraption with n.8AB3788BD5A3BADB3AE1": "**Vous :** Eh bien, vous ne le seriez pas non plus si vous voliez dans une machine sans instructions claires pour l'atterrissage.",
  "**Time Beetle:** I'm right here with you, you know, but let's get back to the po.A217A61097063A613A5B": "**Scarabée temporel :** Je suis juste là avec vous, vous savez, mais revenons au sujet.",
  "How prompt engineering can help application developers": "Comment l'ingénierie des invites peut aider les développeurs d'applications",
  "**Time Beetle:** As a practitioner, being able to craft a better prompt is a ski.F62989D9BE2F90E5CA11": "**Scarabée temporel :** En tant que praticien, être capable de formuler une meilleure invite est une compétence que vous voulez avoir dans votre boîte à outils.",
  "Looking at it from the perspective of a developer, you can use prompt engineerin.566D03E64A49B84B6BF4": "D'un point de vue développeur, vous pouvez utiliser l'ingénierie des invites pour :",
  "**Get more accurate results** from your language model and ultimately improve th.3E25E0641AB14075AD4B": "**Obtenir des résultats plus précis** de votre modèle de langage et, au final, améliorer l'expérience utilisateur de votre application.",
  "**Control the output** of the model to ensure it's relevant and appropriate for .0E4E4A56D0E0E1A857A7": "**Contrôler la sortie** du modèle pour s'assurer qu'elle est pertinente et appropriée pour vos utilisateurs. Cela est particulièrement important lorsqu'il s'agit de sujets sensibles et également pour protéger la réputation de votre marque.",
  "**Format the output** in a way that's easy to understand and consume. We will lo.CE160EC97FE5227248EA": "**Formater la sortie** d'une manière facile à comprendre et à consommer. Nous allons approfondir cet aspect dans le prochain chapitre.",
  "**Time Beetle:** Let's explore the different techniques and strategies you can u.1AD38429324A56A00BAA": "**Time Beetle :** Explorons les différentes techniques et stratégies que vous pouvez utiliser pour concevoir des invites efficaces pour votre modèle de langage.",
  "Prompt engineering techniques and strategies": "Techniques et stratégies d'ingénierie des invites",
  "**Time Beetle:** Here are a few techniques and strategies you can use to craft e.A94683695E7FFBFDDB23": "**Time Beetle :** Voici quelques techniques et stratégies que vous pouvez utiliser pour concevoir des invites efficaces :",
  "**Few-shot prompting**. This technique involves giving the AI a few examples to .6D43AC2E68A2AEA92517": "**L'invite avec quelques exemples (Few-shot prompting)**. Cette technique consiste à donner à l'IA quelques exemples pour montrer le type de réponse que vous souhaitez.",
  "**Chain-of-thought prompting**. This technique involves providing a sequence of .A5C27269342E744A1E6B": "**L'invite par chaîne de raisonnement (Chain-of-thought prompting)**. Cette technique consiste à fournir une séquence d'invites pour enseigner à l'IA comment résoudre une tâche complexe étape par étape.",
  "**Meta-prompts**. This technique involves adding extra details or instructions t.F8B0648B6D55BFF3B87F": "**Les méta-invites (Meta-prompts)**. Cette technique consiste à ajouter des détails ou instructions supplémentaires pour façonner de manière plus précise les sorties de l'IA.",
  "**Maieutic prompting**. This technique involves using guiding questions to steer.844406F978A6983E0277": "**L'invite maïeutique (Maieutic prompting)**. Cette technique consiste à utiliser des questions directrices pour orienter l'IA vers une réponse spécifique.",
  "**You:** That sounds interesting, I assume you will give me some examples?": "**Vous :** Cela semble intéressant. Je suppose que vous allez me donner quelques exemples ?",
  "**Time Beetle:** Yes, coming right up. Let's look at examples for each of these .37451E68F8F792A815C8": "**Time Beetle :** Oui, tout de suite. Examinons des exemples pour chacune de ces techniques afin de comprendre comment elles fonctionnent en pratique.",
  "Few-shot prompting: Give examples to guide AI output": "Invite avec quelques exemples : Fournir des exemples pour guider la sortie de l'IA",
  "Few-shot prompting gives an AI model a few examples to guide its output. Imagine.FB9D5F12233991FDBB27": "L'invite avec quelques exemples donne au modèle d'IA quelques exemples pour orienter ses sorties. Imaginez que vous êtes dans l'aéronef hélicoïdal et que vous posez des questions sur la Rome antique. Voici à quoi pourraient ressembler des invites avec quelques exemples :",
  "\"Tell me about the Roman Colosseum.\" → \"It’s a massive amphitheater.\"": "\"Parlez-moi du Colisée romain.\" → \"C'est un amphithéâtre immense.\"",
  "\"What was life like in ancient Rome?\" → \"It was bustling and tough.\"": "\"À quoi ressemblait la vie dans la Rome antique ?\" → \"Elle était animée et difficile.\"",
  "**You:** I see! That helps the AI get it right, even up here! ;)": "**Vous :** Je vois ! Cela aide l'IA à bien comprendre, même ici haut ! ;)",
  "**Time Beetle:** Exactly, it’s a solid method. Next up!": "**Time Beetle :** Exactement, c'est une méthode solide. Passons à la suite !",
  "Chain-of-Thought Prompting: Show step-by-step reasoning": "Invite par chaîne de raisonnement : Montrer un raisonnement étape par étape",
  "**Time Beetle:** This technique guides the AI by showing it step-by-step reasoni.4DD603BE0E43D01C7B61": "**Time Beetle :** Cette technique guide l'IA en montrant un raisonnement étape par étape pour résoudre un problème. Imaginez l'atterrissage de l'aéronef hélicoïdal. Vous pourriez le décomposer de cette manière :",
  "You’re 100 meters up.": "Vous êtes à 100 mètres d'altitude.",
  "Gravity pulls at 9.8 m/s².": "La gravité exerce une force de 9,8 m/s².",
  "Your prompt becomes:": "Votre invite devient :",
  "100 meters above ground": "100 mètres au-dessus du sol",
  "How many seconds to land?": "Combien de secondes pour atterrir ?",
  "**You:** That’s quick—hope the numbers work out!": "**Vous :** C'est rapide—j'espère que les chiffres sont justes !",
  "**Time Beetle:** It teaches the AI to think step-by-step.": "**Time Beetle :** Cela apprend à l'IA à penser étape par étape.",
  "**You:** So it’s about breaking problems down for accurate answers?": "**Vous :** Alors, c'est une question de décomposer les problèmes pour obtenir des réponses précises ?",
  "**Time Beetle:** Yep, perfect for complex tasks like a math tutor app!": "**Time Beetle :** Oui, parfait pour des tâches complexes comme une application de tutorat en mathématiques !",
  "Maieutic Prompting: Question the output to verify accuracy": "Invite maïeutique : Questionner la sortie pour vérifier l'exactitude",
  "**Time Beetle:** This technique uses questions to check the AI’s output for accu.B71285C37CC14F6F928F": "**Time Beetle :** Cette technique utilise des questions pour vérifier l'exactitude des sorties de l'IA. Vous interrogez chaque étape pour assurer un raisonnement cohérent.",
  "**You:** So, question everything it says? Sounds fun. ;)": "**Vous :** Donc, questionner tout ce qu'elle dit ? Cela semble amusant. ;)",
  "**Time Beetle:** Let’s test our aerial screw landing:": "**Time Beetle :** Testons l'atterrissage de l'aéronef hélicoïdal :",
  "100 meters up": "100 mètres d'altitude",
  "How many seconds to land? (Answer: 4.5s)": "Combien de secondes pour atterrir ? (Réponse : 4,5s)",
  "Height = 100m, initial vertical speed = 0 m/s, gravity = 9.8 m/s².": "Hauteur = 100m, vitesse verticale initiale = 0 m/s, gravité = 9,8 m/s².",
  "**Time Beetle:** It’s about verifying AI answers with follow-up questions.": "**Time Beetle :** Il s'agit de vérifier les réponses de l'IA avec des questions complémentaires.",
  "**You:** So, don’t trust it—probe it with questions instead?": "**Vous :** Alors, ne pas lui faire confiance—la questionner à la place ?",
  "**Time Beetle:** Exactly! Ensures solid reasoning.": "**Time Beetle :** Exactement ! Cela garantit un raisonnement solide.",
  "Meta Prompts: Add extra instructions for precision": "Méta-invites : Ajouter des instructions supplémentaires pour plus de précision",
  "**Time Beetle:** Next up, meta prompts.": "**Time Beetle :** Ensuite, les méta-invites.",
  "**You:** Ugh, tea first?": "**Vous :** Urgh, du thé d'abord ?",
  "**Time Beetle:** *Sigh*. They add guidance to prompts for better output—great fo.CE49B79995039704A5DD": "**Time Beetle :** *Soupir*. Elles ajoutent des directives aux invites pour de meilleures sorties—c'est idéal pour des applications sensibles destinées aux clients.",
  "Here’s an example:": "Voici un exemple :",
  "**Meta Prompt:** Use only Contoso Inc. products (basketballs, soccer balls, tenn.94CADC8FDC45E3E46E99": "**Meta-Invite :** Utilisez uniquement les produits de Contoso Inc. (ballons de basket, ballons de football, raquettes de tennis). Restez précis et convivial.\n**Invite :** Meilleurs produits sportifs pour les débutants ?\n**Réponse :** Ballons de basket, ballons de football, et raquettes de tennis—parfaits pour la coordination et l'agilité.",
  "It ensures accuracy and sticks to Contoso’s products. Without it:": "Cela garantit de l'exactitude tout en respectant les produits de Contoso. Sans cela :",
  "**Prompt:** Best sports products for beginners?\n**Response:** Basketballs, socce.97C67966719D80CA9602": "**Invite :** Meilleurs produits sportifs pour les débutants ?\n**Réponse :** Ballons de basket, ballons de football, raquettes de tennis, plus des ballons de rugby—*pas tous des articles Contoso*.",
  "**You:** Handy! Keeps responses on track, like laws for my automaton.": "**Vous :** Pratique ! Ça garde les réponses sur le bon chemin, comme des lois pour mon automate.",
  "**Time Beetle:** You’d know, *\"Frankenstein\"*—er, nothing!": "**Time Beetle :** Vous devriez le savoir, *\"Frankenstein\"*—euh, rien !",
  "**You:** What?": "**Vous :** Quoi ?",
  "**Time Beetle:** Never mind.": "**Time Beetle :** Rien, oubliez.",
  "Mary Shelley’s *Frankenstein*—1818, 42 years before your time travels. [Read mor.A684C21886A8B2C566B1": "Mary Shelley’s *Frankenstein*—1818, 42 ans avant vos voyages dans le temps. [Lire plus](https://fr.wikipedia.org/wiki/Mary_Shelley)",
  "**You:** So, no meta prompt means chaos?": "**Vous :** Donc, pas de méta-invite, c'est le chaos ?",
  "**Time Beetle:** Yep, you’d get off-brand answers.": "**Time Beetle :** Oui, vous obtiendriez des réponses peu alignées avec la marque.",
  "**You:** Got it, precision matters!": "**Vous :** Compris, la précision est importante !",
  "Assignment - Let's help our heroes land the aerial screw": "Exercice - Aidons nos héros à poser l'aéronef hélicoïdal",
  "**You:** This is the part where you show me how to land the aerial screw, right?.76F1D8427FA592789804": "**Vous :** C'est le moment où vous me montrez comment poser l'aéronef hélicoïdal, n'est-ce pas ?",
  "**Time Beetle:** Yes, let's get to it. The hill is roughly 100 meters away from .F2571B4873642925F9F8": "**Time Beetle :** Oui, allons-y. La colline est à environ 100 mètres de notre position actuelle. Voici comment nous pouvons configurer l'invite :",
  "Current height above the ground: 100 meters": "Hauteur actuelle au-dessus du sol : 100 mètres",
  "Moving forward at: 10 meters per second": "Se déplaçant vers l'avant à : 10 mètres par seconde",
  "Wind upwards at: 0.7 meters per second": "Vent ascendant à : 0,7 mètres par seconde",
  "**Leonardo:** Can your AI gizmo help in calculating to see if we will make it or.8808AE4216B4196C0F11": "**Léonard :** Ton gadget IA peut-il aider à calculer si nous allons réussir ou si nous devons faire un autre saut dans le temps ?",
  "**Time Beetle:** I can yes, my name is George though, I prefer that over Gizmo. .361293E2D82113D4B65E": "**Time Beetle :** Je peux, oui, mais mon nom est George, je préfère cela à \"Gadget\". Je vais en fait vous laisser, vous deux, trouver comment configurer l'invite. ☺️",
  "Build an app that asks for:": "Créez une application qui demande :",
  "Height": "Hauteur",
  "Forward speed": "Vitesse vers l'avant",
  "Gravity": "Gravité",
  "Upward wind": "Vent ascendant",
  "Distance to hill": "Distance à la colline",
  "Use the chain-of-though technique to arrive at a response.": "Utilisez la technique de la chaîne de raisonnement pour arriver à une réponse.",
  "Here's a starter project [Starter project](/app/README.md).": "Voici un projet de démarrage [Projet de démarrage](/app/README.md).",
  "Solution": "Solution",
  "Build an app in JavaScript that asks for the following inputs:": "Créez une application en JavaScript qui demande les entrées suivantes :",
  "Current height above the ground": "Hauteur actuelle au-dessus du sol",
  "Moving forward at meters per second": "Se déplaçant vers l'avant en mètres par seconde",
  "Gravity in meters per second squared": "Gravité en mètres par seconde carré",
  "Upward wind in meters per second": "Vent ascendant en mètres par seconde",
  "Distance to the hill": "Distance à la colline",
  "Then use the LLM to incorporate these inputs and leverage the chain of thought p.CF65B540B7D80D413ABD": "Puis utilisez le LLM pour incorporer ces entrées et profitez de la technique de la chaîne de raisonnement pour guider le modèle vers la bonne réponse.",
  "Knowledge Check": "Test de connaissances",
  "**Question:** What is prompt engineering? Select all that apply.": "**Question :** Qu'est-ce que l'ingénierie des invites ? Sélectionnez tout ce qui s'applique.",
  "A. Prompt engineering is about building bridges and roads.": "A. L'ingénierie des invites consiste à construire des ponts et des routes.",
  "B. Prompt engineering is about crafting the right prompts to get the desired out.DD509FDBE34672337399": "B. L'ingénierie des invites consiste à concevoir les bonnes invites pour obtenir la sortie souhaitée d'un modèle de langage.",
  "C. Prompt engineering is about training a model to recognize patterns in data.": "C. L'ingénierie des invites consiste à former un modèle à reconnaître des motifs dans les données.",
  "Quiz solution": "Solution pour le test",
  "Self-Study Resources": "Ressources pour l'auto-apprentissage",
  "Prompt engineering": "Ingénierie des invites",
  "Prompt engineering fundamentals": "Principes fondamentaux de l'ingénierie des invites",
  "Advanced prompt engineering": "Ingénierie des invites avancée",
  "![Watch a short video about prompt engineering](https://img.youtube.com/vi/gQ6Tl.057F143DAF3372327114": "Regardez une courte vidéo sur l'ingénierie des invites",
  "![\"An angry Ludovico Sforza busting in through the door](https://raw.githubuserc.E875504D283FEA4C282D": "Un Ludovico Sforza en colère défonçant la porte",
  "![Escape from Rome](https://raw.githubusercontent.com/microsoft/generative-ai-wi.7B855AF895957E606D3D": "Fuite de Rome",
  "![Airborne, looks down at the city with feet dangling](https://raw.githubusercon.E163CBDA93393105C445": "Dans les airs, regardant la ville avec les pieds qui pendent",
  "![Ludovico Sforza](https://raw.githubusercontent.com/microsoft/generative-ai-wit.3C38D24A92B23EE0A29E": "Ludovico Sforza",
  "Glossary": "Glossaire",
  "A comprehensive list of technical terms used throughout the lessons.": "Une liste complète de termes techniques utilisés tout au long des leçons.",
  "**API (Application Programming Interface)**: A set of rules enabling software ap.6439DDA0C81127F2414B": "**API (Interface de Programmation d'Application)** : Un ensemble de règles permettant à des applications logicielles de communiquer entre elles, couramment utilisé dans l'intégration de l'IA générative.",
  "**API key**: A private key used to authenticate requests to an application progr.74BCA5C8CDBC1D457772": "**Clé API** : Une clé privée utilisée pour authentifier les requêtes à une interface de programmation d'application.",
  "**Augmented Prompt**: A prompt enhanced with additional context or information t.B208E9AA1B25823F25D9": "**Prompt Augmenté** : Un prompt enrichi par un contexte ou des informations supplémentaires pour améliorer la pertinence des réponses générées par l'IA.",
  "**Azure AI Studio**: A platform to build, evaluate, and deploy AI models using M.EA7E0749409251F09607": "**Azure AI Studio** : Une plateforme pour concevoir, évaluer et déployer des modèles d'IA en utilisant Microsoft Azure.",
  "**Azure OpenAI**: A cloud service for deploying and scaling OpenAI models like G.F64C91105C2DB4C5AABA": "**Azure OpenAI** : Un service cloud pour déployer et mettre à l'échelle des modèles OpenAI comme GPT pour des applications.",
  "**Caesar cipher**: A substitution cipher shifting characters by a fixed number o.C3850DF15C6883B8CA31": "**Chiffrement de César** : Un chiffre de substitution déplaçant les caractères d'un nombre fixe de places dans l'alphabet.",
  "**Chain-of-Thought Prompting**: A technique guiding models to break down complex.FEAFD6D6F9322844FC7A": "**Chain-of-Thought Prompting** : Une technique guidant les modèles à décomposer des tâches complexes en étapes de raisonnement séquentielles afin d'améliorer la précision des résultats.",
  "**Chatbot**: An application designed to simulate conversation with human users, .0A56BB3BAE061807BEC3": "**Chatbot** : Une application conçue pour simuler une conversation avec des utilisateurs humains, souvent en utilisant le traitement du langage naturel.",
  "**Completions API**: API to generate text or code based on inputs, used for pred.39A98814E9432FBD5A80": "**Completions API** : Une API pour générer du texte ou du code basé sur des entrées, utilisée pour des tâches prédictives ou génératives dans les modèles d'IA.",
  "**Context Window**: The amount of past input that a language model can consider .171723165F7F392DC9D4": "**Fenêtre de Contexte** : La quantité d'entrées passées qu'un modèle de langage peut prendre en compte lors de la génération de réponses, mesurée en tokens.",
  "**CSV (Comma-Separated Values)**: A data format consisting of values separated b.0480E798A0EBE8A679D0": "**CSV (Valeurs Séparées par des Virgules)** : Un format de données composé de valeurs séparées par des virgules, souvent utilisé pour la récupération et la modification de données structurées.",
  "**Embedding**: Numeric vector representation of data, often used for semantic se.B4898604EA161788642D": "**Embedding** : Représentation vectorielle numérique de données, souvent utilisée pour la recherche sémantique ou le regroupement dans l'apprentissage automatique.",
  "**Escape Hatch**: A technique instructing AI to admit lack of knowledge when dat.F676E6756EAD27EFF39B": "**Système d'Échappatoire** : Une technique qui pousse l'IA à admettre un manque de connaissance lorsque les données sont insuffisantes à garantir des réponses précises.",
  "**Few-Shot Prompting**: A method of providing minimal examples to the model to i.CEBF1B9866D4630AF6E1": "**Few-Shot Prompting** : Une méthode consistant à fournir des exemples minimaux au modèle pour influencer ses résultats avec un contexte ou un format spécifique.",
  "**Full-Stack Development**: Development of both the client (frontend) and server.A0F893AF7BA5B0FB36A8": "**Développement Full-Stack** : Développement à la fois de la partie cliente (frontend) et serveur (backend) dans des applications logicielles.",
  "**Function Calling**: A method for passing structured prompt data into specific .659D2558C67DBFE12AB7": "**Appel de Fonctions** : Une méthode permettant de transmettre des données structurées à des fonctions spécifiques au sein d'une application de manière programmatique.",
  "**GitHub Codespaces**: A cloud-based environment for coding, testing, and runnin.2D112B25095D5611891E": "**GitHub Codespaces** : Un environnement basé sur le cloud pour coder, tester et exécuter des applications directement depuis des dépôts GitHub.",
  "**GitHub Models**: A platform hosting pre-trained AI models for use and integrat.23DEB1FE79B84DA499D4": "**Modèles GitHub** : Une plateforme hébergeant des modèles d'IA pré-entraînés pour une utilisation et une intégration dans les flux de travail de développement GitHub.",
  "**GitHub Token**: An authentication method to access GitHub-hosted APIs or servi.6B5097583FB64D767B9D": "**Jeton GitHub** : Une méthode d'authentification pour accéder de manière sécurisée aux APIs ou services hébergés par GitHub.",
  "**IDE (Interactive Development Environment)**: Software providing coding, debugg.75166B52B49EDE0B6CCC": "**IDE (Environnement de Développement Interactif)** : Logiciel fournissant des outils de codage, de débogage et de test pour les développeurs.",
  "**JSON (JavaScript Object Notation)**: A lightweight data-interchange format use.A6AA0BE873FFB5A0E587": "**JSON (JavaScript Object Notation)** : Un format d'échange de données léger utilisé pour les échanges structurés d'informations entre systèmes, y compris les réponses d'IA génératives.",
  "**Knowledge Bases**: Data repositories used to enhance AI applications by provid.1ED908461F1DBFE9DB2B": "**Bases de Connaissances** : Répertoires de données utilisés pour améliorer les applications d'IA en fournissant des informations fiables et spécifiques à un domaine.",
  "**LangChain**: A framework for building AI applications that focus on chaining m.0868684B44ABE4C99664": "**LangChain** : Un cadre pour construire des applications d'IA qui se concentrent sur l'enchaînement de plusieurs modèles et fonctionnalités.",
  "**LLM (Large Language Model)**: AI models trained on large text datasets to gene.743A7CF565CC98C12E42": "**LLM (Large Language Model)** : Modèles d'IA entraînés sur de grands ensembles de données textuelles pour générer des réponses similaires à celles des humains dans diverses applications.",
  "**Maieutic Prompting**: A technique involving follow-up queries to challenge or .E0399C3DEFE5B06E1E19": "**Maieutic Prompting** : Une technique impliquant des questions de suivi pour challenger ou valider les réponses générées par l'IA en termes de précision et de raisonnement.",
  "**Managed Identity**: A secure cloud mechanism that provides applications with a.A9814F8420C69A1B088F": "**Identité Gérée** : Un mécanisme cloud sécurisé qui fournit aux applications une authentification automatique pour accéder aux ressources sans gérer de mots de passe.",
  "**Markdown**: A lightweight markup language for formatting plain text into struc.53F0909A07672F379A72": "**Markdown** : Un langage de balisage léger pour formater du texte brut en mises en page structurées, comme des tableaux ou des listes.",
  "**MCP (Model Context Protocol)**: A protocol to decentralize applications by sep.EA72BE64E0557626B966": "**MCP (Protocole de Contexte Modèle)** : Un protocole destiné à décentraliser les applications en séparant les capacités des serveurs et les protocoles de connexion.",
  "**Meta Prompts**: Instructions added before a user's prompt to refine or restric.8C3357387E3061D4EE7A": "**Meta Prompts** : Instructions ajoutées avant le prompt d'un utilisateur pour affiner ou restreindre le comportement et le format de sortie de l'IA.",
  "**Multimodal Capabilities**: AI functionality to process various formats like te.C4AFF07040F3FD73ABB6": "**Capacités Multimodales** : Fonctionnalités d'IA pour traiter différents formats tels que le texte, les images ou les vidéos en entrée et fournir des sorties variées.",
  "**Node.js**: A runtime environment allowing developers to execute JavaScript cod.4DF9D474829F7EE1926D": "**Node.js** : Un environnement d'exécution permettant aux développeurs d'exécuter du code JavaScript côté serveur pour créer des applications évolutives.",
  "**OpenAI**: A pioneering organization in AI research and APIs for language model.180B5C210BB914D7E4C3": "**OpenAI** : Une organisation pionnière dans la recherche en IA et les APIs pour des modèles de langage intégrés dans des applications pour des tâches génératives.",
  "**Prompt Engineering**: The process of crafting effective prompts to guide AI mo.CCA614B362C4FE43E380": "**Ingénierie de Prompt** : Le processus de conception de prompts efficaces pour guider les modèles d'IA vers des réponses et des comportements souhaités.",
  "**RAG (Retrieval-Augmented Generation)**: A technique combining retrieval-based .ADDE45BAAD46070C91BA": "**RAG (Génération Augmentée par Récupération)** : Une technique combinant des méthodes basées sur la récupération et des modèles génératifs pour des résultats plus précis et ancrés dans les données.",
  "**Semantic Search**: Search method leveraging the meaning of terms for more cont.FFF38E931AAE02C66AAE": "**Recherche Sémantique** : Méthode de recherche exploitant la signification des termes pour des résultats contextuellement plus précis et nuancés.",
  "**Structured Output**: Data output organized in predefined formats like tables o.3C52819EE7C725893B26": "**Sortie Structurée** : Sortie de données organisée dans des formats prédéfinis comme des tableaux ou du JSON, permettant une intégration plus facile avec les systèmes.",
  "**System Message**: A prompt in conversational AI that specifies contextual boun.B996B531AD44B846A81F": "**Message Système** : Un prompt dans l'IA conversationnelle qui spécifie les limites contextuelles ou la personnalité de l'assistant.",
  "**TensorFlow\\.js**: A JavaScript-based machine learning library enabling browser.469DCB0C7D0AA16F295F": "**TensorFlow.js** : Une bibliothèque d'apprentissage automatique basée sur JavaScript permettant de développer et d'entraîner des applications IA/ML dans le navigateur ou avec Node.js.",
  "**Tokenizer**: A tool used to convert text into tokens, providing structure for .D0FB6D4C053BB44081A3": "**Tokenizer** : Un outil utilisé pour convertir du texte en tokens, fournissant une structure à la façon dont les données sont saisies ou analysées par les modèles.",
  "**Vector Search**: Retrieval technique comparing encoded vectors to find semanti.F2A2E2E26F4D73CDD3C8": "**Recherche Vectorielle** : Technique de récupération comparant des vecteurs encodés pour trouver des informations sémantiquement similaires dans les applications d'IA.",
  "**XML (eXtensible Markup Language)**: A markup language formatting structured da.E3AA88DF8845675EDF00": "**XML (eXtensible Markup Language)** : Un langage de balisage formatant des données structurées pour le stockage, l'échange ou l'entrée/sortie dans des modèles génératifs.",
  "Lessons": "Leçons",
  "01 - Intro to Gen AI": "01 - Introduction à Gen AI",
  "02 - First AI App": "02 - Première application IA",
  "03 - Prompt Engineering": "03 - Ingénierie des invites",
  "04 - Structured Output": "04 - Résultat structuré",
  "05 - Retrieval Augmented Generation": "05 - Génération augmentée par récupération",
  "06 - Tool Calling": "06 - Appels d'outils",
  "07 - MCP": "07 - MCP",
  "08 - MCP, improving Client with LLM": "08 - MCP, amélioration du client avec LLM",
  "Generative AI for beginners with JavaScript": "Intelligence artificielle générative pour les débutants avec JavaScript",
  "![License](https://img.shields.io/badge/License-MIT-blue?style=flat-square)": "Licence",
  "![Watch the video series](https://img.shields.io/badge/Videos-d95652.svg?style=f.3A4EEDF7C90E6BD0097C": "Regarder la série de vidéos",
  "![PRs Welcome](https://img.shields.io/badge/PRs-welcome-brightgreen.svg?style=fl.2842C5C914928C0EF926": "Contributions Bienvenues",
  "![Azure AI Discord](https://dcbadge.limes.pink/api/server/kzRShWzttr)": "Azure AI Discord",
  "![Azure AI Foundry Developer Forum](https://img.shields.io/badge/GitHub-Azure_AI.B1BB927142F8C7096A43": "Forum des développeurs Azure AI Foundry",
  "⭐ If you like this repo, star it on GitHub — it helps a lot!": "⭐ Si vous aimez ce dépôt, ajoutez-lui une étoile sur GitHub — cela aide énormément !",
  "Ready to integrate Generative AI into your JavaScript apps?": "Prêt à intégrer l'IA générative dans vos applications JavaScript ?",
  "![Character App Sneak Peek](/docs/images/background.png)": "Aperçu de l'application de personnages",
  "NEW - MCP lessons just added": "NOUVEAU - Leçons MCP ajoutées",
  "Call for help - help us translate !": "Appel à l'aide - aidez-nous à traduire !",
  "Step into history with AI magic!": "Entrez dans l'histoire avec la magie de l'IA !",
  "Dive into an immersive learning experience powered by Generative AI:": "Plongez dans une expérience d'apprentissage immersive alimentée par l'IA générative :",
  "![Interact with History through conversation](/docs/images/character-chat.png)": "Interagir avec l'Histoire grâce à la conversation",
  "“It’s like a comic book with code!” — Happy User": "\"C'est comme une bande dessinée avec du code !\" — Utilisateur heureux",
  "Getting started": "Commencer",
  "Throughout this course you'll find many code examples and exercises, so we encou.6B7E2CF5BE1F60212AAD": "Tout au long de ce cours, vous trouverez de nombreux exemples de code et exercices, alors nous vous encourageons à les exécuter et à expérimenter avec le code dans votre propre copie de ce dépôt :",
  "Lesson description": "Description des leçons",
  "📦 Each lesson includes:": "📦 Chaque leçon comprend :",
  "🗃️ Table of contents": "🗃️ Table des matières",
  "\\#": "#",
  "Lesson Link": "Lien vers la leçon",
  "Description": "Description",
  "Introduction to Generative AI and LLMs for JavaScript Developers": "Introduction à l'IA générative et aux LLM pour les développeurs JavaScript",
  "Understand Generative AI and LLM fundamentals, their applications and limits in .DD85F59F1F68828851A8": "Comprendre les fondamentaux de l'IA générative et des modèles de langage étendus, leurs applications et leurs limites en JavaScript, et comment utiliser l'IA pour améliorer les expériences utilisateur.",
  "Build your first AI app": "Créez votre première application d'IA",
  "Set up your development environment, write a basic app, and understand system pr.E7422CC9F454B518A0B8": "Configurez votre environnement de développement, créez une application de base et comprenez les invites système.",
  "Structured output": "Sortie structurée",
  "Learn structured output, how to extract data from prompts, and present it in var.A7F3A233BB684F066ADC": "Apprenez la sortie structurée, comment extraire des données des invites et les présenter sous différents formats, comme JSON, pour une consommation facilitée.",
  "Retrieval augmented generation (RAG)": "Génération augmentée par récupération (RAG)",
  "Learn the basics of RAG, how to integrate external data, and how to leverage it .EBFB78976998F8D642B4": "Découvrez les bases de RAG, comment intégrer des données externes et comment les exploiter pour des réponses de l'IA plus pertinentes et plus précises.",
  "Tool calling/Function calling": "Appel d'outils/Appel de fonctions",
  "Learn how to give your LLM extra capbilities, bring your own functions": "Apprenez à donner des capacités supplémentaires à votre LLM, apportez vos propres fonctions.",
  "MCP, Model Context Protocol": "MCP, Protocole de Contexte Modèle ",
  "Teaches how to get started with MCP to standardize how to expose prompts, resour.76C5691FBF84CAB54BE2": "Apprenez à vous initier au MCP pour standardiser l'exposition des invites, ressources et outils.",
  "Enhancing MCP Clients with Large Language Models": "Améliorer les clients MCP avec des modèles de langage étendus",
  "Learn how to improve your MCP app by improving clients with LLM and more": "Découvrez comment améliorer votre application MCP en enrichissant les clients avec des LLM et plus encore.",
  "New lessons will be added to the course over time, so stay tuned!": "De nouvelles leçons seront ajoutées au cours au fil du temps, restez à l'écoute !",
  "Keep learning": "Continuez à apprendre",
  "🙌 After completing this course, you can continue learning by exploring our addi.8A6088F60612EFF0459F": "🙌 Après avoir terminé ce cours, vous pouvez continuer à apprendre en explorant nos ressources supplémentaires.",
  "Session": "Session",
  "Slides": "Diapositives",
  "Demo": "Démo",
  "Script": "Script",
  "Video": "Vidéo",
  "Series introduction": "Introduction de la série",
  "Introduces the series and its content.": "Introduction de la série et de son contenu.",
  "pptx": "pptx",
  "pdf": "pdf",
  "📺": "📺",
  "What you need to know about LLMs": "Ce qu'il faut savoir sur les LLMs",
  "Explores what LLMs are, how they're trained, how they work and their limits.": "Explore ce que sont les LLM, comment ils sont entraînés, comment ils fonctionnent et leurs limites.",
  "Essential prompt engineering techniques": "Techniques essentielles d'ingénierie des invites",
  "Practical prompt engineering techniques to get the best out of AI models.": "Techniques pratiques d'ingénierie des invites pour tirer le meilleur parti des modèles d'IA.",
  "Improve AI accuracy and reliability with RAG": "Améliorer la précision et la fiabilité de l'IA avec RAG",
  "Introduces Retrieval-Augmented Generation, to use AI with your own data.": "Introduction à la génération augmentée par la récupération pour utiliser l'IA avec vos propres données.",
  "Speed up your AI development with LangChain.js": "Accélérez le développement de votre IA avec LangChain.js",
  "Covers LangChain.js framework core concepts, and how to use it to accelerate AI .E9282A677E6C95FE298D": "Couvre les concepts de base du framework LangChain.js et explique comment l'utiliser pour accélérer les développements d'IA.",
  "Run AI models on your local machine with Ollama": "Exécutez des modèles d'IA sur votre machine locale avec Ollama",
  "Shows how to integrate local AI models into your development workflow.": "Montre comment intégrer des modèles d'IA locaux dans votre flux de travail de développement.",
  "Get started with AI for free using Phi-3": "Commencez avec l'IA gratuitement en utilisant Phi-3",
  "Experiments with Ollama and Phi-3 model directly from your browser.": "Expérimentez avec Ollama et le modèle Phi-3 directement depuis votre navigateur.",
  "Introduction to Azure AI Foundry": "Introduction à Azure AI Foundry",
  "Kickstart your journey with Azure AI Foundry.": "Lancez votre voyage avec Azure AI Foundry.",
  "Building Generative AI Apps with Azure Cosmos DB": "Construire des applications génératives d'IA avec Azure Cosmos DB",
  "Build generative AI apps with Azure Cosmos DB and vector search.": "Construisez des applications génératives d'IA avec Azure Cosmos DB et la recherche vectorielle.",
  "Azure tools & services for hosting and storing AI apps": "Outils et services Azure pour héberger et stocker des applications d'IA",
  "Build, deploy, and scale AI applications using Azure tools.": "Construisez, déployez et mettez à l'échelle des applications d'IA en utilisant des outils Azure.",
  "Streaming Generative AI output with the AI Chat Protocol": "Diffuser les résultats de l'IA générative avec le protocole AI Chat",
  "Integrate streaming easily into your apps with the AI Chat Protocol.": "Intégrez facilement le streaming dans vos applications grâce au protocole AI Chat.",
  "To see the full page of resources, go to this [video overview page](/videos/READ.E005A4253BFBADFE0960": "Pour voir la page complète des ressources, rendez-vous sur cette [page d'aperçu vidéo](/videos/README.md).",
  "Generative AI for Beginners": "IA générative pour les débutants",
  "Generative AI for Beginners .NET": "IA générative pour les débutants .NET",
  "Generative AI with JavaScript": "IA générative avec JavaScript",
  "AI for Beginners": "IA pour les débutants",
  "AI Agents for Beginners - A Course": "Agents d'IA pour les débutants - Un cours",
  "Data Science for Beginners": "Science des données pour les débutants",
  "ML for Beginners": "ML pour les débutants",
  "Cybersecurity for Beginners": "Cybersécurité pour les débutants",
  "Web Dev for Beginners": "Développement Web pour les débutants",
  "IoT for Beginners": "IoT pour les débutants",
  "XR Development for Beginners": "Développement XR pour les débutants",
  "Mastering GitHub Copilot for Paired Programming": "Maîtriser GitHub Copilot pour la programmation en binôme",
  "Mastering GitHub Copilot for C#/.NET Developers": "Maîtriser GitHub Copilot pour les développeurs C#/.NET",
  "Choose Your Own Copilot Adventure": "Choisissez votre propre aventure Copilot",
  "You'll also find additional resources in the form of [tutorials, code samples an.48F4D16C5EACB9FBEE99": "Vous trouverez également des ressources supplémentaires sous forme de [tutoriels, exemples de code et plus](/docs/additional-resources.md).",
  "Responsible AI Disclaimer": "Clause de non-responsabilité sur l'IA responsable",
  "[!IMPORTANT]\nDISCLAIMER: This repository contains fictional content generated by.49D00740BCC7CB765042": "AVERTISSEMENT : Ce dépôt contient du contenu fictif généré par l'IA. Les personnages historiques représentés ici génèrent des réponses grâce à une IA générative, qui est basée sur des données d'entraînement. Les réponses générées par ces personnages ne représentent pas leurs véritables opinions ou citations. Ce contenu est uniquement destiné à des fins de divertissement. [Principes d'IA responsable de Microsoft ici](https://www.microsoft.com/en-us/ai/principles-and-approach/)",
  "Interact with community": "Interagir avec la communauté"
}